---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleView.SetLockSlot(System.Int32,System.Int32,System.Boolean)
source: html/c6d88e84-7f6a-9c29-b026-1f87c74bca62.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleView.SetLockSlot Method

Set lock state for a circuit slot at specific cell.

## Syntax (C#)
```csharp
public void SetLockSlot(
	int nRow,
	int nCol,
	bool bLock
)
```

## Parameters
- **nRow** (`System.Int32`) - Row Number
- **nCol** (`System.Int32`) - Column Number
- **bLock** (`System.Boolean`) - Lock state to set